{
    "archived": false,
        "boardName": "Robinhood : Retrospective Sprint 21",
            "columns": [
                {
                    "color": 1,
                    "id": 1,
                    "value": "Good"
                },
                {
                    "color": 2,
                    "id": 2,
                    "value": "Bad"
                },
                {
                    "color": 3,
                    "id": 3,
                    "value": "Try"
                },
                {
                    "color": 6,
                    "id": 4,
                    "value": "Top Vote"
                }
            ],
                "date_created": "2021-02-15T10:19:46.000Z",
                    "messages": [
                        {
                            "date": "2021-02-15T10:21:07.746Z",
                            "date_created": "2021-02-15T10:21:07.746Z",
                            "text": "ผ่านไปอีก 1 release ขอบคุณทุกๆคนมากครับ <3",
                            "type": {
                                "id": 1
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                },
                                {
                                    "User2": 1
                                }
                            ]
                        },
                        {
                            "date": "2021-02-15T10:27:44.738Z",
                            "date_created": "2021-02-15T10:27:44.738Z",
                            "text": "ติดดอยบน DogeCoin",
                            "type": {
                                "id": 2
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "date": "2021-02-15T10:27:52.994Z",
                            "date_created": "2021-02-15T10:27:52.994Z",
                            "text": "อยากหาแฟน",
                            "type": {
                                "id": 3
                            }
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:31:46.682Z",
                                    "text": "DELTA เลยครับ จัดว่าเคยเด็ด",
                                    "owner": "rockon23146@gmail.com"
                                },
                                {
                                    "date": "2021-02-15T10:35:41.745Z",
                                    "text": "นั้นมันการพนันชัดๆ 5555"
                                }
                            ],
                            "date": "2021-02-15T10:30:26.928Z",
                            "date_created": "2021-02-15T10:30:26.928Z",
                            "text": "อยากเล่นหุ้น",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:29:59.336Z",
                                    "text": "อยากให้ estimate effort งานกันอีกทีหลัง spec มาครบจริงๆ แล้ว"
                                }
                            ],
                            "date": "2021-02-15T10:24:49.509Z",
                            "date_created": "2021-02-15T10:24:49.509Z",
                            "text": "ลองใช้ Story Point ในการประเมินงานเข้ามาจริงๆจังๆดีไหม\n---\nอยาก estimate effort ให้ออกมาเป๊ะๆกว่านี้",
                            "type": {
                                "id": 4
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                },
                                {
                                    "User2": 1
                                }
                            ],
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:26:55.641Z",
                                    "text": "++ ซื้อไม่ทัน เศร้า"
                                }
                            ],
                            "date": "2021-02-15T10:26:03.420Z",
                            "date_created": "2021-02-15T10:26:03.420Z",
                            "text": "อดซื้อหุ้น OR",
                            "type": {
                                "id": 2
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ],
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "date": "2021-02-15T10:23:16.805Z",
                            "date_created": "2021-02-15T10:23:16.805Z",
                            "text": "จะตั้งใจกับงานมากขึ้น อยากให้งานออกมาดีๆ",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:21:39.990Z",
                                    "text": "เรื่องจริงที่ต้องยอมรับ เฮ้อออออ"
                                },
                                {
                                    "date": "2021-02-15T10:23:06.880Z",
                                    "text": "อยากให้เปลี่ยนคนทำ"
                                }
                            ],
                            "date": "2021-02-15T10:21:22.457Z",
                            "date_created": "2021-02-15T10:21:22.457Z",
                            "text": "เหนื่อยใจกับ Sapient",
                            "type": {
                                "id": 4
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ]
                        },
                        {
                            "date": "2021-02-15T10:22:23.135Z",
                            "date_created": "2021-02-15T10:22:23.135Z",
                            "text": "ดีใจที่ได้ร่วมทีมกับทุกคนนะครับ ทีมให้ความช่วยเหลือดีมากๆครับผม (พุธ)",
                            "type": {
                                "id": 1
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ]
                        },
                        {
                            "date": "2021-02-15T10:36:12.350Z",
                            "date_created": "2021-02-15T10:36:12.350Z",
                            "text": "ขอบคุณทีมมากครับที่ support งานด่วน ๆ landing & banner  testing",
                            "type": {
                                "id": 1
                            }
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:55:45.831Z",
                                    "text": "มา fe ไหมครับ"
                                }
                            ],
                            "date": "2021-02-15T10:29:50.520Z",
                            "date_created": "2021-02-15T10:29:50.520Z",
                            "text": "อยากเปลี่ยน role",
                            "type": {
                                "id": 3
                            }
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:40:53.241Z",
                                    "text": "นอน"
                                }
                            ],
                            "date": "2021-02-15T10:33:31.172Z",
                            "date_created": "2021-02-15T10:33:31.172Z",
                            "text": "อยากมีความสุขกับการทำงาน",
                            "type": {
                                "id": 2
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:54:56.989Z",
                                    "text": "1. ไม่มีที่เสนอไอเดีย 2. เสนอไอเดียแล้ว BU ไม่รับ",
                                    "owner": "rockon23146@gmail.com"
                                }
                            ],
                            "date": "2021-02-15T10:24:43.905Z",
                            "date_created": "2021-02-15T10:24:43.905Z",
                            "text": "เสนอไอเดียออกไป ไม่มีคนฟังหรือเห็นด้วยเลย หรือไอเดียเรามันห่วย?",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "date": "2021-02-15T10:21:08.901Z",
                            "date_created": "2021-02-15T10:21:08.901Z",
                            "text": "ขอบคุณสำหรับการตั้งใจทำงานในทุกๆ Sprint มากๆ เลยนะครับ",
                            "type": {
                                "id": 1
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:29:56.181Z",
                                    "text": "แต่ต้องยอมด้วยโดนคนมองไม่ดีด้วยน้า Tradeoff กัน"
                                },
                                {
                                    "date": "2021-02-15T10:28:36.370Z",
                                    "text": "อยากด้วย"
                                },
                                {
                                    "date": "2021-02-15T10:26:18.981Z",
                                    "text": "พอปฏิเสธก็หาว่าใจร้าย"
                                }
                            ],
                            "date": "2021-02-15T10:25:47.011Z",
                            "date_created": "2021-02-15T10:25:47.011Z",
                            "text": "อยากฝึกทักษะการปฏิเสธ เพราะเหมือนต้องยอมคนอื่นตลอดเลย",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:29:00.723Z",
                                    "text": "+1"
                                }
                            ],
                            "date": "2021-02-15T10:28:37.272Z",
                            "date_created": "2021-02-15T10:28:37.272Z",
                            "text": "อยากหาเวลาออกกำลังกายบ้าง",
                            "type": {
                                "id": 3
                            }
                        },
                        {
                            "date": "2021-02-15T10:24:20.486Z",
                            "date_created": "2021-02-15T10:24:20.486Z",
                            "text": "หาเวลามาเล่นเกมส์กัน",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:46:03.508Z",
                                    "text": "กด report ได้มั้ย"
                                }
                            ],
                            "date": "2021-02-15T10:26:47.818Z",
                            "date_created": "2021-02-15T10:26:47.818Z",
                            "text": "ฝากหน่อยครับ https://www.facebook.com/nopyjohnfarmer",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ],
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:46:02.647Z",
                                    "text": "คนมันรวยเงินฝากเกิน 5 แสน 555"
                                }
                            ],
                            "date": "2021-02-15T10:40:43.871Z",
                            "date_created": "2021-02-15T10:40:43.871Z",
                            "text": "4000 ม.33 ก็ไม่ได้กับเขา",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "date": "2021-02-15T10:24:11.347Z",
                            "date_created": "2021-02-15T10:24:11.347Z",
                            "text": "Support เยอะจังเลย --- กำลังรับ SA & QA เข้ามาเพิ่มให้อยู่น้า ถ้าได้มาแล้ว งานน่าจะสนุกขึ้น",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "date": "2021-02-15T10:33:02.264Z",
                            "date_created": "2021-02-15T10:33:02.264Z",
                            "text": "อยากไป outing แล้ว",
                            "type": {
                                "id": 4
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:23:56.979Z",
                                    "text": "1 หั่นงานให้เล็กที่สุด",
                                    "owner": "rockon23146@gmail.com"
                                }
                            ],
                            "date": "2021-02-15T10:23:07.107Z",
                            "date_created": "2021-02-15T10:23:07.107Z",
                            "text": "เราจะทำงานเป็น Sprint จริงๆ จังๆยังไงดี เพื่อที่จะได้ release ทุกๆ 2 อาทิตย์",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:24:50.158Z",
                                    "text": "ใช่ทุก feature เลยอะ"
                                },
                                {
                                    "date": "2021-02-15T10:22:41.336Z",
                                    "text": "จะช่วยไปสื่อความให้นะครับ"
                                },
                                {
                                    "date": "2021-02-15T10:25:20.336Z",
                                    "text": "+1"
                                },
                                {
                                    "date": "2021-02-15T10:24:36.279Z",
                                    "text": "+1 spec ui ไม่ค่อยละเอียด"
                                }
                            ],
                            "date": "2021-02-15T10:22:06.333Z",
                            "date_created": "2021-02-15T10:22:06.333Z",
                            "text": "อยากให้ ui ทำงานให้ละเอียด feature เปลี่ยน icon เปลี่ยนขนาด",
                            "type": {
                                "id": 4
                            },
                            "votes": [
                                {
                                    "User0": 1
                                },
                                {
                                    "User1": 3
                                },
                                {
                                    "User2": 1
                                },
                                {
                                    "User3": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:33:53.081Z",
                                    "text": "เศร้าจัง ไม่รู้เพราะอากาศหรืออะไร 😭"
                                },
                                {
                                    "date": "2021-02-15T10:27:21.327Z",
                                    "text": "เคยมีด้วยหรอครับ"
                                }
                            ],
                            "date": "2021-02-15T10:26:38.443Z",
                            "date_created": "2021-02-15T10:26:38.443Z",
                            "text": "ฤดูหนาว หมดไปแล้ว เศร้าจัง",
                            "type": {
                                "id": 2
                            }
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:57:35.927Z",
                                    "text": "รู้สึกดีขึ้นมั้งนะ"
                                }
                            ],
                            "date": "2021-02-15T10:24:57.512Z",
                            "date_created": "2021-02-15T10:24:57.512Z",
                            "text": "ลอง cut-off เวลาทำงานกันที่ 18:00 หรือ 19:00 กันดีไหมครับ",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:28:34.679Z",
                                    "text": "ขอเลขเด็ดหน่อยจิ"
                                },
                                {
                                    "date": "2021-02-15T10:24:56.799Z",
                                    "text": "มีความหวังกับทุกงวดดด"
                                },
                                {
                                    "date": "2021-02-15T10:23:38.625Z",
                                    "text": "พรุ่งนี้รวยยย"
                                }
                            ],
                            "date": "2021-02-15T10:23:14.079Z",
                            "date_created": "2021-02-15T10:23:14.079Z",
                            "text": "อยากรวย เหนื่อยแล้ว",
                            "type": {
                                "id": 3
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "comments": [
                                {
                                    "date": "2021-02-15T10:22:40.511Z",
                                    "text": "Target : Q1 2021",
                                    "owner": "rockon23146@gmail.com"
                                }
                            ],
                            "date": "2021-02-15T10:22:31.284Z",
                            "date_created": "2021-02-15T10:22:31.284Z",
                            "text": "Try to completed dev+automate test ทั้ง ui & api ก่อน implement",
                            "type": {
                                "id": 4
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ],
                            "owner": "rockon23146@gmail.com"
                        },
                        {
                            "date": "2021-02-15T10:25:05.572Z",
                            "date_created": "2021-02-15T10:25:05.572Z",
                            "text": "หาแฟนให้บอย",
                            "type": {
                                "id": 3
                            }
                        },
                        {
                            "date": "2021-02-15T10:24:18.058Z",
                            "date_created": "2021-02-15T10:24:18.058Z",
                            "is_action": false,
                            "is_done": false,
                            "text": "ไม่ชอบทำงาน multi task เลย",
                            "type": {
                                "id": 2
                            },
                            "votes": [
                                {
                                    "User0": 1
                                }
                            ]
                        },
                        {
                            "date": "2021-02-15T10:24:33.714Z",
                            "date_created": "2021-02-15T10:24:33.714Z",
                            "text": "ทำงานเยอะแล้ว ยังมีคนว่าไม่ทำงานอีก 😭 รู้สึกแย่กับสิ่งที่ทุ่มเทไป",
                            "type": {
                                "id": 4
                            },
                            "owner": "rockon23146@gmail.com"
                        }
                    ],
                        "owner": "rockon23146@gmail.com"
}